kEpsilon/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    topInlet
    {
        // type            fixedValue;
        // value           $internalField;
        type fixedValue; 
        value uniform 0; 
    }

    bottomInlet
    {
        // type            fixedValue;
        // value           $internalField;
        type fixedValue; 
        value uniform 0; 
    }

    outlet
    {
        // type            fixedValue;
        // value           $internalField;
        // type zeroGradient; 
        type fixedValue; 
        value uniform 0; 
    }

    walls
    {
        // type            fixedValue;
        // value           $internalField;
        type fixedValue; 
        value uniform 0; 
    }

    reflecting
    {
        type zeroGradient; 
    }

    frontBack
    {
        type empty; 
    }
}

// ************************************************************************* //
