kEpsilon/constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// porosity1
// {
//     type            explicitPorositySource;
//     active          yes;

//     explicitPorositySourceCoeffs
//     {
//         selectionMode   cellZone;
//         cellZone        porosity;

//         type            DarcyForchheimer;

//         DarcyForchheimerCoeffs
//         {
//             d   (2e8 -1000 -1000);
//             f   (0 0 0);

//             coordinateSystem
//             {
//                 type    cartesian;
//                 origin  (0 0 0);
//                 coordinateRotation
//                 {
//                     type    axesRotation;
//                     e1  (0.70710678 0.70710678 0);
//                     e2  (0 0 1);
//                 }
//             }
//         }
//     }
// }


//************************************************************************* //
